Tekla Open API Reference for Tekla Structures 2025
PluginPickerInput Class
 The PluginPickerInput class represents a predefined set of picker inputs that can be provided to a plug-in object. It replaces the interactive selection of points and/or objects by the user when the plug-in is inserted into a drawing through the API.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.PluginPickerInput
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class PluginPickerInput
<SerializableAttribute>
Public Class PluginPickerInput
The PluginPickerInput type exposes the following members.
Constructors
Name | Description
PluginPickerInput()
 Initializes a new instance of the PluginPickerInput class with an empty list of picker inputs.
PluginPickerInput(List<PickerInput>)
 Initializes a new instance of the PluginPickerInput class which contains a predefined sequence of inputs.
Top
Methods
Name | Description
Add
 Appends a picker input to the plug-in input.
AddRange
 Appends several picker inputs to the picker input sequence.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace